{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 16, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d", "strides": [2, 2], "padding": "same", "pool_size": [2, 2]}, "name": "max_pooling2d", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 8, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "name": "conv2d_1", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "same", "pool_size": [2, 2]}, "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 8, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "same", "pool_size": [2, 2]}, "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten", "dtype": "float32"}, "name": "flatten", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 40, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_regularizer": null, "name": "dense", "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "relu"}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 128, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "relu"}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [4, 4, 8], "name": "reshape", "dtype": "float32"}, "name": "reshape", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "batch_input_shape": [null, 4, 4, 8], "kernel_constraint": null, "filters": 8, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "name": "conv2d_3", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "dtype": "float32", "trainable": true, "name": "up_sampling2d"}, "name": "up_sampling2d", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 8, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_4", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "name": "conv2d_4", "inbound_nodes": [[["up_sampling2d", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "dtype": "float32", "trainable": true, "name": "up_sampling2d_1"}, "name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 16, "bias_constraint": null, "padding": "valid", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_5", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "name": "conv2d_5", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "size": [2, 2], "dtype": "float32", "trainable": true, "name": "up_sampling2d_2"}, "name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 1, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_6", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "sigmoid"}, "name": "conv2d_6", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_6", 0, 0]], "name": "model_1"}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}